import github.VolunteerDB;

public class FillVolunteerDB {

    public static void main(String[] args) {

        //create database and volunteer actions table
        VolunteerDB.createDatabase();
        VolunteerDB.dropTable();
        VolunteerDB.createTable();

        //insert volunteer actions to table
        VolunteerDB.insertVolunteerAction("Συγκέντρωση Χριστουγεννιάτικων Δώρων για παιδιά", "Αττική", "1 ώρα, δια ζώσης, παιδιά, ατομικό, ανθρωπιστικό", "2023-12-16 09:30 - 13:30");
        VolunteerDB.insertVolunteerAction("Εθελοντική Αιμοδοσία Ελληνικού Ερυθρού Σταυρού", "Αγιος Στέφανος, Αττική", "1 ώρα, δια ζώσης, ατομικό, ανθρωπιστικό, αιμοδοσία", "2023-12-16 10:00 - 16:00");
        VolunteerDB.insertVolunteerAction("Δεντροφύτευση στην Πεντέλη", "Πεντέλη, Αττική", "δια ζώσης, 3-4 ώρες, ομαδικό, περιβάλλον, χειρονακτικό", "2023-12-17 10:00");
        VolunteerDB.insertVolunteerAction("Καθαρισμό του περιβάλλοντος χώρου του Δάσους Υμηττού","Βύρωνας, Αττική", "Κατά τη διάρκεια της δράσης, οι εθελοντές ενημερώθηκαν για τη ρύπανση, τη φροντίδα και αισθητική του δασικού τοπίου, ενώ επίσης συζήτησαν και για τους τρόπους με τους οποίες οι συνήθειες μας επηρεάζουν το φυσικό περιβάλλον", "Παρασκευή 20 Οκτωβρίου 2023");
        VolunteerDB.insertVolunteerAction("Εθελοντική Αιμοδοσία Ελληνικού Ερυθρού Σταυρού", "Νέα Σμύρνη, Αττική", "1 ώρα, δια ζώσης, ατομικό, ανθρωπιστικό, αιμοδοσία", "2023-12-16 16:00 - 21:00");
        VolunteerDB.insertVolunteerAction("Αειθαλεία - Ολιστικό πρόγραμμα για τον εθελοντισμό ατόμων τρίτης ηλικίας", "Πειραιας, Αττικη", "Καθαρισμός ωκεανών και ειδικότερα για τη θαλάσσια ρύπανση και τον τρόπο με τον οποίο οι συνήθειες μας επηρεάζουν τους ωκεανούς μας", "Σάββατο 16 Σεπτεμβρίου");
        VolunteerDB.insertVolunteerAction("Προγράμματα Εθελοντικής Εργασίας (WorkCamps),", "Ελλάδα και το εξωτερικό", "προστασία του φυσικού περιβάλλοντος, εργασίες σε προστατευόμενες περιοχές, χάραξη, οριοθέτηση και σηματοδότηση μονοπατιών, ξυλοκατασκευές, δενδροφυτέυσεις, καθαρισμός βλάστησης", "2024");
        VolunteerDB.insertVolunteerAction("Γιατροί χωρίς σύνορα", "Αφορούν αποστολές από τον Εύρο μέχρι την Μέση Ανατολή", "Ιατρικό και μη ιατρικό προσωπικό αναζητά σταθερά η γνωστή ΜΚΟ για τα προγράμματά της", "2024");
        VolunteerDB.insertVolunteerAction("Voluntea", "Βερανζέρου 15, Αθήνα στον 5ος όροφος", "Να σε βοηθήσει να επιλέξεις το καταλληλότερο πρόγραμμα εθελοντισμού στο εξωτερικό για το καλοκαίρι", "Κάθε Πέμπτη, σε δύο ομάδες, με την πρώτη να ξεκινά στις 16:00 και τη δεύτερη στις 17:00");
        VolunteerDB.insertVolunteerAction("A Kitchen for Good", "Μεταξουργείο, Αττικη", " Οικιακή Κοινωνική Κουζίνα εντός του Εθελοντικού Συντονιστικού Κέντρου (ΕΣΚ) της χώρας, καλύπτοντας σε εβδομαδιαία βάση φρέσκο φαγητό για τους άστεγους πολίτες της Αττικής", "Κάθε Σάββατο 10:00πμ");
        VolunteerDB.insertVolunteerAction("Πρόγραμμα Στήριξης των Πληγέντων της Θεσσαλίας για το 2024", "Σε πάνω από 12 χωριά της Θεσσαλίας", "Βοήθεια στους πληγέντες", "Ξεκίνησε το Νοέμβριο του 2023");
        VolunteerDB.insertVolunteerAction("#GIVINGTUESDAY", "Αττική", "Μπορείτε να προσφέρετε εσείς τα αγαθά ή καθαρό και ευπρεπή ρουχισμό στο Εθελοντικό Συντονιστικό Κέντρο, ώστε να συμπεριληφθούν στα πακέτα στήριξης", " 28 Νοεμβρίου 2023");
        VolunteerDB.insertVolunteerAction("Αυτά τα Χριστούγεννα μαζί με το OPEN «Aνοίγουμε την Aγκαλιά μας στην Tρίτη ηλικία»", " Εθελοντικό Συντονιστικό Κέντρο του Humanity Greece", "Προσφορά χριστουγεννιάτικης βοήθειας σε άπορους παππούδες και γιαγιάδες", "");
        VolunteerDB.insertVolunteerAction("«Βοήθεια στο Σπίτι»", " Εθελοντικό Συντονιστικό Κέντρο του Humanity Greece", "Προσφορά βοήθειας σε άπορους ανθρώπους στα σπίτια τους", "Καθημερινά");
        VolunteerDB.insertVolunteerAction("WWF Προστασία για τα δάση μας", "https://www.wwf.gr/ti_mporeis_na_kaneis/ekstrateies/prostasia_gia_ta_dasi/", "Υπογραφή ιντερνετική για τη δήλωση", "");
        VolunteerDB.insertVolunteerAction("Blue Panda", "Σούνιο, τη Γυάρο και τη Σύρο", "Το ιστιοπλοϊκό σκάφος του WWF, διασχίζουμε και φέτος τη Μεσόγειο και θα μοιραστούμε με εσάς ιστορίες και εικόνες από τον πλούτο των θαλασσών μας. Μαζί θα ανακαλύψουμε τη «θάλασσα που θέλουμε»!", "Από τις 3 έως και τις 13 Σεπτεμβρίου");
        VolunteerDB.insertVolunteerAction("WWF:ΥΙΟΘΕΤΗΣΕ ΕΝΑ ΑΠΕΙΛΟΥΜΕΝΟ ΕΙΔΟΣ", "https://donate.wwf.gr/yiothetise", "Με μια συμβολική υιοθεσία μπορείς να κάνεις τη διαφορά μεταξύ εξαφάνισης και επιβίωσης για ένα πολύτιμο κομμάτι της άγριας ζωής.", "");
        VolunteerDB.insertVolunteerAction("ActionAID:Γίνε Ανάδοχος", "https://actionaid.gr/gine-anadohos", "", "");
        VolunteerDB.insertVolunteerAction("Εθελοντισμός στο Κέντρο της ActionAid στην Αθήνα", "Αθήνα, Αττική", "Υπηρεσία Συμβουλευτικής Εύρεσης Εργασίας, Ενισχυτική διδασκαλία, Μαθήματα Ελληνικών & Αγγλικών, Μαθήματα Υπολογιστών, Απογευματινά Δημιουργικά Προγράμματα, Θεατρικό Παιχνίδι, Summer Camp", "Καθημερινές");
        VolunteerDB.insertVolunteerAction("Εθελοντισμός στα Κεντρικά Γραφεία της ActionAID", "Καντρικά γραφεία ActionAID", "Αλληλογραφία, Αρχειοθέτηση, Διοικητικές εργασίες, Τμήμα επικοινωνίας", "Καθημερινές");
        VolunteerDB.insertVolunteerAction("Εθελοντισμός σε Εκδηλώσεις της ActionAID", "", "Φεστιβάλ, Εκθέσεις Φωτογραφίας/ Ζωγραφικής, Αθλητικά Event, Γιορτές", "Κυρίως Σάββατο και Κυριακή");
        VolunteerDB.insertVolunteerAction("HELMEPA:¨Παγκόσμιος Εθελοντικός Καθαρισμός Ακτών", "Αττική", "ΒΙΩΜΑΤΙΚΗ ΔΡΑΣΗ ΚΑΘΑΡΙΣΜΟΥ", "Από 16 Σεπτεμβρίου μέχρι 16 Νοεμβρίου 2023");
        
        


        //print all volunteer actions in database
        System.out.println(VolunteerDB.getAllVolunteerActions());

    }

}

